
&НаСервереБезКонтекста
Процедура СформироватьНаСервере(Диаграмма)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НачисленияФактическийПериодДействия.Сотрудник,
	               |	НачисленияФактическийПериодДействия.ВидРасчета,
	               |	НачисленияФактическийПериодДействия.ПериодДействияНачало,
	               |	НачисленияФактическийПериодДействия.ПериодДействияКонец,
	               |	НачисленияФактическийПериодДействия.Результат,
	               |	НачисленияФактическийПериодДействия.Регистратор,
	               |	НачисленияФактическийПериодДействия.Регистратор.Представление
	               |ИЗ
	               |	РегистрРасчета.Начисления.ФактическийПериодДействия КАК НачисленияФактическийПериодДействия";
    ВыборкаРезультата = Запрос.Выполнить().Выбрать();
	//запретить обновление диаграммы
	ДиаграммаОбновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ОтображатьЗаголовок = Ложь;
	
	//заполнить диаграмму
	Пока ВыборкаРезультата.Следующий()  Цикл
		//получаем серию, точку и их значение  
		ТекущаяСерия = Диаграмма.УстановитьСерию(ВыборкаРезультата.ВидРасчета);
		ТекущаяТочка = Диаграмма.УстановитьТочку(ВыборкаРезультата.Сотрудник);
		ТекущееЗначение = Диаграмма.ПолучитьЗначение(ТекущаяТочка, ТекущаяСерия);
		
		//создаем нужные интервалы в значении
		ТекущийИнтервал = ТекущееЗначение.Добавить();
		ТекущийИнтервал.Начало = ВыборкаРезультата.ПериодДействияНачало;
		ТекущийИнтервал.Конец = ВыборкаРезультата.ПериодДействияКонец;
		ТекущийИнтервал.Текст = ВыборкаРезультата.РегистраторПредставление;
		ТекущийИнтервал.Расшифровка = ВыборкаРезультата.Регистратор;
	
	КонецЦикла;
	//раскрасить серии своими цветами
	Для каждого Серия  Из Диаграмма.Серии Цикл
		Если Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
			Серия.Цвет = WebЦвета.ЖелтоЗеленый;
		ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Премия Тогда
			Серия.Цвет = WebЦвета.Коралловый;
		ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Премия Тогда
			Серия.Цвет = WebЦвета.ГрифельноСиний;
	    
		КонецЕсли;
		
	
	КонецЦикла;
	//разрешить обновление диаграммы
	Диаграмма.Обновление = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(ДиаграммаГанта);
КонецПроцедуры
